Documents/ОприходованиеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОприходованиеМатериалов</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияМатериалов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РегистрМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОприходованиеМатериалов/Ext/ObjectModule.bsl
// Процедура ОбработкаЗаполнения выполняется,
// когда документ "ОприходованиеМатериалов" создается на основании другого документа.
// В данном случае документ заполняется на основании "ИнвентаризацияМатериалов".
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	// Проверяем, что основанием является именно документ "ИнвентаризацияМатериалов".
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияМатериалов") Тогда

		// Получаем объект инвентаризации по ссылке.
		// Это нужно, чтобы прочитать склад, ответственного и строки материалов.
		Инвентаризация = ДанныеЗаполнения.ПолучитьОбъект();

		// Переносим склад из инвентаризации.
		Склад = Инвентаризация.Склад;
		
		// Ответственный из инвентаризации становится сотрудником в документе оприходования.
		Сотрудник = Инвентаризация.Ответственный;
		
		// Сохраняем ссылку на документ-основание.
		// Так будет понятно, по какой инвентаризации создано оприходование.
		ДокументОснование = ДанныеЗаполнения;

		// Очищаем табличную часть перед заполнением,
		// чтобы в ней не осталось старых строк.
		Материалы.Очистить();

		// Перебираем все строки материалов из документа инвентаризации.
		Для Каждого СтрИнв Из Инвентаризация.Материалы Цикл

			// Если материал в строке не заполнен,
			// такую строку пропускаем.
			Если Не ЗначениеЗаполнено(СтрИнв.Материал) Тогда
				Продолжить;
			КонецЕсли;

			// В оприходование попадают только излишки.
			// Излишек — это когда фактический остаток больше учетного,
			// то есть отклонение больше нуля.
			Если СтрИнв.Отклонение <= 0 Тогда
				Продолжить;
			КонецЕсли;

			// Добавляем новую строку в табличную часть "Материалы".
			НоваяСтрока = Материалы.Добавить();
			
			// Переносим материал из строки инвентаризации.
			НоваяСтрока.Материал = СтрИнв.Материал;
			
			// Количество к оприходованию равно положительному отклонению.
			// Например, если по учету 5, а фактически 8,
			// отклонение равно 3, значит нужно оприходовать 3.
			НоваяСтрока.Количество = СтрИнв.Отклонение;
			
			// Цена берется из учетной цены, рассчитанной в инвентаризации.
			НоваяСтрока.Цена = СтрИнв.ЦенаУчета;
			
			// Рассчитываем сумму строки:
			// количество умножается на цену.
			// Округляем до двух знаков после запятой.
			НоваяСтрока.Сумма = Окр(НоваяСтрока.Количество * НоваяСтрока.Цена, 2);

		КонецЦикла;

		// После заполнения табличной части пересчитываем документ,
		// чтобы общая сумма была актуальной.
		ПересчитатьДокумент();

	КонецЕсли;

КонецПроцедуры


// Процедура ПередЗаписью выполняется перед записью документа.
// Здесь проверяется правильность заполнения документа:
// склад, документ-основание, отсутствие повторного оприходования,
// наличие материалов, количество и цена.
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// Проверяем, указан ли склад.
	// Без склада нельзя оприходовать материалы,
	// потому что остатки ведутся по складам.
	Если Не ЗначениеЗаполнено(Склад) Тогда
		
		Сообщить("Не указан склад.");
		
		// Отменяем запись документа.
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;

	// Проверяем, указан ли документ-основание.
	// В данном случае оприходование должно быть связано с инвентаризацией.
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Сообщить("Не указан документ-основание.");
		
		// Отменяем запись документа.
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;

	// Проверяем, не создан ли уже другой документ оприходования
	// по этой же инвентаризации.
	ПроверитьПовторноеОприходование(Отказ);

	// Если в проверке был установлен отказ,
	// прекращаем дальнейшее выполнение процедуры.
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// Пересчитываем суммы строк и общую сумму документа
	// перед записью.
	ПересчитатьДокумент();

	// Переменная показывает, есть ли в документе хотя бы одна строка с материалом.
	ЕстьСтроки = Ложь;

	// Перебираем все строки табличной части "Материалы".
	Для Каждого СтрМатериал Из Материалы Цикл

		// Если материал не заполнен,
		// строку пропускаем.
		Если Не ЗначениеЗаполнено(СтрМатериал.Материал) Тогда
			Продолжить;
		КонецЕсли;

		// Если материал заполнен, значит в документе есть корректная строка.
		ЕстьСтроки = Истина;

		// Количество к оприходованию должно быть больше нуля.
		Если СтрМатериал.Количество <= 0 Тогда
			
			Сообщить(СтрШаблон(
				"Количество по материалу ""%1"" должно быть больше нуля.",
				СтрМатериал.Материал));
				
			// Отменяем запись документа.
			Отказ = Истина;
			
			Возврат;
			
		КонецЕсли;

		// Цена не должна быть отрицательной.
		// Нулевая цена здесь разрешена, но отрицательная цена невозможна.
		Если СтрМатериал.Цена < 0 Тогда
			
			Сообщить(СтрШаблон(
				"Цена по материалу ""%1"" не может быть отрицательной.",
				СтрМатериал.Материал));
				
			// Отменяем запись документа.
			Отказ = Истина;
			
			Возврат;
			
		КонецЕсли;

	КонецЦикла;

	// Если после проверки не найдено ни одной строки с материалом,
	// документ записывать нельзя.
	Если Не ЕстьСтроки Тогда
		
		Сообщить("Нет материалов для оприходования.");
		
		// Отменяем запись документа.
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры


// Процедура ОбработкаПроведения выполняется при проведении документа.
// Здесь создаются движения по регистру накопления "РегистрМатериалов".
// Так как это оприходование, движения создаются с видом "Приход".
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Проверяем, указан ли склад.
	// Без склада нельзя сформировать движение по материалам.
	Если Не ЗначениеЗаполнено(Склад) Тогда
		
		Сообщить("Не указан склад.");
		
		// Отменяем проведение документа.
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;

	// Указываем, что документ будет записывать движения
	// по регистру накопления "РегистрМатериалов".
	Движения.РегистрМатериалов.Записывать = Истина;

	// Перебираем строки табличной части "Материалы".
	Для Каждого СтрМатериал Из Материалы Цикл

		// Если материал не заполнен,
		// движение по такой строке не создаем.
		Если Не ЗначениеЗаполнено(СтрМатериал.Материал) Тогда
			Продолжить;
		КонецЕсли;

		// Если количество меньше или равно нулю,
		// такую строку тоже пропускаем.
		Если СтрМатериал.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;

		// Добавляем новое движение в регистр материалов.
		Движение = Движения.РегистрМатериалов.Добавить();
		
		// Указываем дату движения.
		Движение.Период = Дата;
		
		// Вид движения "Приход",
		// потому что материал добавляется на склад.
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		// Указываем склад, на который оприходуется материал.
		Движение.Склад = Склад;
		
		// Указываем материал.
		Движение.Материал = СтрМатериал.Материал;
		
		// Указываем количество материала.
		Движение.Количество = СтрМатериал.Количество;
		
		// Указываем сумму оприходования.
		Движение.Сумма = СтрМатериал.Сумма;

	КонецЦикла;

КонецПроцедуры


// Процедура пересчитывает документ.
// Она рассчитывает сумму каждой строки и общую сумму документа.
Процедура ПересчитатьДокумент()

	// Переменная для накопления общей суммы документа.
	Итог = 0;

	// Перебираем строки табличной части "Материалы".
	Для Каждого СтрМатериал Из Материалы Цикл

		// Если материал не заполнен,
		// обнуляем количество, цену и сумму строки.
		Если Не ЗначениеЗаполнено(СтрМатериал.Материал) Тогда
			
			СтрМатериал.Количество = 0;
			СтрМатериал.Цена = 0;
			СтрМатериал.Сумма = 0;
			
			Продолжить;
			
		КонецЕсли;

		// Если количество не заполнено,
		// считаем его равным нулю.
		Если Не ЗначениеЗаполнено(СтрМатериал.Количество) Тогда
			СтрМатериал.Количество = 0;
		КонецЕсли;

		// Если цена не заполнена,
		// считаем ее равной нулю.
		Если Не ЗначениеЗаполнено(СтрМатериал.Цена) Тогда
			СтрМатериал.Цена = 0;
		КонецЕсли;

		// Рассчитываем сумму строки:
		// количество умножается на цену.
		// Округляем до двух знаков после запятой.
		СтрМатериал.Сумма = Окр(СтрМатериал.Количество * СтрМатериал.Цена, 2);
		
		// Добавляем сумму строки к общей сумме документа.
		Итог = Итог + СтрМатериал.Сумма;

	КонецЦикла;

	// Записываем итоговую сумму в реквизит документа "ОбщаяСумма".
	ОбщаяСумма = Окр(Итог, 2);

КонецПроцедуры


// Процедура проверяет, не было ли уже создано оприходование
// по этому же документу инвентаризации.
// Это нужно, чтобы случайно не оприходовать одни и те же излишки два раза.
Процедура ПроверитьПовторноеОприходование(Отказ)

	// Если документ-основание не указан,
	// проверять повторное оприходование невозможно.
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;

	// Создаем запрос к документам "ОприходованиеМатериалов".
	Запрос = Новый Запрос;
	
	// Запрос ищет другой документ оприходования,
	// который уже создан по этому же документу-основанию.
	//
	// Условия:
	// 1. ДокументОснование совпадает с текущим.
	// 2. Найденный документ не равен текущему документу.
	// 3. Документ не помечен на удаление.
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Оприходование.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОприходованиеМатериалов КАК Оприходование
	|ГДЕ
	|	Оприходование.ДокументОснование = &ДокументОснование
	|	И Оприходование.Ссылка <> &ТекущаяСсылка
	|	И НЕ Оприходование.ПометкаУдаления";

	// Передаем документ-основание, по которому ищем повтор.
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	// Передаем ссылку текущего документа,
	// чтобы запрос не считал сам документ повтором.
	Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);

	// Если запрос что-то нашел, значит по этой инвентаризации
	// уже есть документ оприходования.
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Сообщить("По этой инвентаризации уже создан документ оприходования.");
		
		// Отменяем запись документа.
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры
